830729
448959
448293
413074
382055
302829
292086
251613
230179
220775
199619
178784
172889
135905
129838
123822
123743
123511
120810
113752
99700
96266
93487
88824
84074
79605
78744
78636
76916
70584
70312
62939
61930
61193
59981
59790
57064
56850
55799
52078
50814
49722
49632
48948
48226
48021
47954
41901
41641
40761
40670
39669
38011
37860
36817
36252
34980
34829
33506
33120
32895
32892
32306
32112
32005
31781
31631
31396
31109
30968
30327
29236
28596
28177
26871
26429
26014
25966
25884
25337
25284
25217
24856
24628
24350
24306
24296
24029
23378
23297
23097
23019
22956
22351
22290
22266
21672
21467
21331
21196
21021
20685
20583
20445
20135
19843
19730
19512
19073
19013
18644
18546
18464
18443
18336
17831
17642
17624
17597
17539
17397
17303
17279
17265
17142
17128
16921
16846
16762
16708
16394
16352
16328
16216
15633
15608
15571
15473
15171
15128
14966
14705
14411
14179
14098
14092
13898
13883
13857
13589
13579
13558
13529
13454
13233
12789
12702
12669
12621
12411
12316
12312
12304
12274
12185
12099
12052
11972
11871
11721
11541
11478
11470
11410
11394
11371
11343
11311
11211
11196
11001
10804
10794
10792
10610
10320
10213
10203
10197
10187
10116
10111
10107
10099
9907
9870
9809
9775
9714
9611
9576
9500
9493
9465
9459
9419
9410
9383
9362
9322
9269
9212
9198
9161
9153
9104
9057
8955
8903
8890
8883
8877
8859
8852
8827
8806
8791
8789
8725
8645
8606
8600
8592
8588
8575
8499
8456
8396
8391
8363
8305
8289
8221
8209
8166
8145
8129
7964
7959
7849
7756
7737
7685
7649
7613
7611
7591
7584
7581
7492
7436
7431
7419
7392
7367
7255
7156
7152
7065
7025
6996
6966
6932
6932
6890
6874
6847
6836
6828
6824
6807
6802
6753
6737
6664
6657
6635
6623
6574
6563
6557
6544
6527
6516
6478
6467
6464
6441
6441
6418
6403
6388
6381
6376
6333
6262
6254
6254
6234
6192
6169
6150
6121
6117
6059
6058
6054
6047
5977
5898
5897
5896
5875
5873
5839
5784
5769
5736
5712
5709
5673
5665
5642
5621
5595
5569
5542
5540
5536
5536
5512
5489
5440
5432
5412
5393
5393
5388
5383
5376
5365
5348
5284
5238
5149
5147
5122
5096
5072
5048
5043
5037
5012
5010
4999
4995
4993
4976
4956
4955
4953
4948
4943
4942
4940
4926
4921
4893
4869
4868
4857
4817
4815
4801
4766
4745
4736
4711
4690
4677
4671
4668
4658
4641
4638
4632
4632
4627
4615
4597
4576
4572
4571
4569
4558
4550
4529
4527
4525
4522
4514
4513
4501
4493
4493
4478
4464
4444
4443
4433
4424
4423
4394
4389
4387
4384
4382
4381
4369
4353
4338
4335
4330
4329
4326
4321
4279
4252
4249
4248
4243
4242
4227
4218
4198
4185
4184
4169
4153
4141
4139
4113
4113
4102
4080
4074
4051
4047
4043
4032
4030
4020
4019
4005
3995
3983
3980
3979
3955
3930
3920
3919
3916
3912
3911
3910
3908
3903
3898
3894
3888
3887
3874
3870
3870
3870
3849
3847
3835
3827
3802
3801
3784
3770
3768
3767
3756
3745
3737
3732
3711
3706
3695
3681
3661
3652
3628
3619
3619
3612
3610
3604
3598
3566
3561
3554
3548
3524
3522
3520
3515
3505
3497
3491
3483
3479
3472
3468
3467
3457
3453
3448
3436
3423
3419
3419
3419
3418
3418
3417
3409
3395
3391
3368
3366
3364
3362
3359
3354
3354
3344
3344
3333
3320
3318
3312
3301
3291
3279
3271
3264
3251
3245
3236
3211
3201
3191
3184
3173
3169
3168
3150
3145
3135
3135
3134
3129
3117
3117
3113
3111
3107
3105
3097
3091
3089
3084
3083
3068
3066
3063
3062
3058
3049
3043
3040
3038
3029
3025
3017
3008
2982
2981
2973
2973
2967
2967
2966
2956
2949
2939
2937
2929
2928
2926
2906
2896
2895
2888
2862
2860
2857
2853
2842
2839
2834
2834
2818
2816
2815
2809
2805
2804
2791
2787
2784
2784
2784
2780
2777
2772
2766
2757
2744
2741
2732
2722
2721
2720
2720
2716
2710
2709
2705
2703
2695
2694
2690
2687
2682
2679
2679
2678
2669
2667
2660
2655
2646
2646
2646
2644
2644
2642
2639
2639
2636
2633
2632
2628
2625
2619
2606
2605
2603
2601
2598
2597
2595
2594
2588
2579
2575
2574
2566
2556
2551
2547
2547
2545
2537
2523
2523
2521
2516
2515
2515
2512
2510
2506
2504
2500
2499
2499
2494
2490
2489
2483
2482
2482
2480
2478
2477
2473
2466
2463
2452
2441
2409
2409
2408
2408
2402
2402
2400
2399
2395
2391
2389
2379
2376
2364
2363
2363
2362
2357
2355
2351
2346
2342
2332
2329
2326
2326
2324
2323
2321
2320
2314
2314
2311
2307
2305
2305
2301
2299
2298
2298
2294
2293
2289
2287
2286
2284
2284
2281
2277
2276
2271
2269
2266
2261
2260
2260
2260
2260
2252
2246
2243
2241
2235
2234
2228
2225
2225
2224
2223
2222
2214
2211
2208
2201
2198
2195
2191
2180
2180
2179
2177
2176
2175
2175
2174
2170
2169
2164
2158
2155
2153
2152
2151
2131
2130
2128
2128
2127
2120
2114
2113
2105
2105
2103
2102
2101
2099
2096
2095
2094
2093
2091
2089
2082
2082
2080
2077
2074
2073
2072
2066
2064
2057
2054
2045
2045
2044
2040
2040
2038
2031
2027
2020
2020
2016
2015
2013
2011
2002
2002
1995
1995
1993
1993
1992
1990
1989
1989
1987
1986
1986
1982
1981
1974
1973
1972
1971
1968
1968
1967
1963
1961
1951
1950
1947
1946
1945
1945
1944
1944
1941
1936
1936
1926
1918
1914
1913
1912
1907
1894
1892
1891
1887
1886
1885
1883
1875
1875
1875
1875
1871
1870
1868
1867
1866
1864
1864
1862
1861
1860
1860
1858
1856
1855
1854
1854
1852
1850
1849
1847
1843
1842
1842
1841
1834
1831
1830
1828
1827
1825
1822
1820
1815
1813
1813
1812
1809
1809
1807
1806
1805
1803
1799
1790
1789
1787
1785
1783
1779
1778
1777
1774
1774
1772
1769
1767
1767
1763
1761
1760
1760
1758
1758
1757
1754
1750
1748
1745
1741
1737
1737
1733
1730
1729
1729
1722
1719
1718
1716
1713
1710
1710
1709
1704
1703
1697
1697
1695
1694
1691
1689
1689
1688
1688
1685
1684
1683
1683
1682
1682
1681
1679
1676
1676
1675
1673
1669
1667
1665
1664
1664
1663
1661
1659
1658
1657
1657
1649
1644
1643
1638
1635
1635
1633
1631
1629
1628
1628
1627
1618
1615
1610
1609
1608
1603
1603
1601
1600
1599
1597
1595
1594
1593
1592
1591
1590
1588
1588
1584
1584
1581
1574
1573
1570
1567
1564
1561
1560
1557
1553
1553
1551
1551
1548
1547
1545
1545
1540
1540
1539
1539
1539
1539
1537
1535
1532
1531
1530
1530
1528
1527
1522
1519
1518
1518
1516
1516
1512
1506
1503
1502
1499
1498
1497
1496
1496
1496
1493
1491
1491
1489
1486
1484
1484
1481
1479
1477
1474
1473
1472
1471
1470
1469
1469
1467
1467
1466
1466
1459
1459
1457
1456
1456
1455
1453
1452
1452
1450
1450
1450
1450
1448
1448
1444
1444
1444
1438
1436
1435
1435
1435
1435
1435
1433
1432
1427
1426
1425
1423
1422
1420
1416
1415
1415
1415
1408
1407
1405
1403
1402
1400
1394
1394
1394
1392
1391
1390
1386
1384
1384
1383
1382
1382
1380
1377
1371
1368
1366
1365
1362
1361
1358
1357
1356
1355
1355
1352
1352
1352
1349
1348
1347
1346
1345
1343
1342
1342
1341
1341
1340
1339
1339
1338
1338
1337
1335
1335
1334
1333
1333
1333
1332
1332
1331
1330
1329
1324
1323
1322
1319
1319
1317
1317
1316
1316
1313
1307
1307
1307
1307
1307
1305
1304
1303
1302
1302
1302
1301
1301
1299
1297
1297
1293
1293
1290
1289
1288
1288
1288
1288
1285
1284
1283
1283
1280
1274
1273
1272
1272
1272
1269
1268
1268
1267
1266
1265
1265
1262
1262
1262
1261
1258
1258
1257
1256
1256
1254
1251
1250
1250
1250
1249
1249
1247
1247
1246
1246
1246
1246
1245
1243
1243
1240
1238
1237
1236
1232
1231
1227
1226
1225
1222
1222
1221
1220
1218
1217
1215
1214
1212
1212
1211
1211
1210
1210
1209
1209
1208
1208
1207
1205
1205
1204
1204
1203
1202
1201
1201
1199
1199
1199
1198
1197
1196
1196
1196
1195
1195
1194
1193
1193
1193
1192
1190
1189
1188
1187
1186
1186
1184
1184
1184
1184
1183
1182
1181
1179
1173
1173
1171
1170
1170
1170
1170
1169
1168
1168
1165
1164
1162
1160
1160
1159
1159
1159
1158
1157
1155
1155
1155
1155
1153
1152
1151
1151
1148
1148
1148
1144
1144
1143
1143
1142
1140
1139
1139
1139
1139
1139
1138
1138
1138
1137
1137
1135
1134
1133
1133
1132
1131
1130
1127
1125
1125
1124
1123
1122
1122
1122
1121
1120
1119
1119
1118
1115
1115
1113
1113
1110
1110
1110
1109
1108
1108
1106
1106
1106
1105
1104
1104
1104
1102
1101
1099
1098
1098
1097
1097
1094
1094
1093
1093
1092
1091
1090
1090
1087
1087
1087
1085
1085
1085
1085
1084
1084
1084
1083
1082
1081
1080
1079
1079
1075
1074
1072
1071
1070
1070
1070
1068
1067
1066
1064
1064
1063
1060
1060
1058
1057
1056
1056
1055
1053
1052
1051
1051
1051
1050
1048
1048
1047
1047
1045
1045
1043
1043
1043
1036
1034
1034
1034
1033
1033
1033
1032
1031
1030
1028
1028
1027
1027
1027
1027
1026
1024
1023
1023
1022
1022
1020
1018
1017
1016
1016
1016
1015
1014
1012
1012
1012
1012
1011
1010
1009
1009
1009
1009
1008
1006
1006
1006
1005
1004
1003
1003
1002
1001
1000
999
997
995
994
993
993
992
989
988
988
986
986
984
984
984
984
984
984
983
983
983
982
982
981
980
980
980
979
979
978
977
977
975
975
975
975
974
974
974
973
973
972
971
971
970
970
969
969
969
968
967
967
967
966
965
964
964
964
963
963
961
961
961
960
960
960
960
960
960
958
958
957
956
956
955
955
954
951
950
950
948
948
947
946
946
944
944
944
943
943
943
942
940
940
939
939
939
939
938
937
937
935
935
935
934
934
933
932
930
930
930
929
929
928
927
926
926
926
924
922
922
921
920
919
919
918
918
917
916
915
915
915
911
910
910
910
906
905
905
905
903
903
902
902
902
902
902
901
900
899
899
898
898
897
897
897
896
895
895
894
893
893
893
893
893
892
890
890
889
889
889
888
888
887
887
886
884
883
883
883
882
882
880
879
878
877
877
876
876
875
875
875
874
872
871
871
870
870
869
869
869
868
868
867
867
867
866
863
862
862
862
861
861
860
860
860
859
859
857
856
856
856
856
855
855
855
854
853
852
851
851
850
850
848
848
848
846
845
845
845
845
844
844
843
843
842
842
842
842
842
842
840
840
839
839
839
839
838
838
838
838
837
837
836
836
835
834
833
833
833
833
831
831
831
831
831
830
830
830
830
830
830
829
828
828
828
826
826
824
823
823
822
820
820
820
820
819
819
819
818
818
817
817
817
814
814
813
813
812
812
811
811
811
810
810
810
809
808
807
807
807
807
807
807
807
806
805
804
804
804
804
803
801
801
801
799
798
797
797
796
796
794
794
794
793
793
793
793
792
792
791
791
790
789
789
789
788
788
788
788
788
786
785
785
785
785
785
785
784
784
783
782
782
782
781
781
781
781
781
780
780
779
778
777
777
777
777
776
775
774
774
774
773
773
773
772
772
769
769
768
768
768
768
766
764
764
764
764
763
763
763
763
763
763
762
762
762
762
761
761
760
760
760
760
760
758
758
757
757
757
756
755
755
755
753
752
751
751
751
750
749
749
749
749
748
747
747
746
746
745
745
743
742
742
742
742
741
741
740
740
740
739
738
737
737
737
736
734
734
733
733
732
732
732
731
731
731
731
730
729
729
728
728
727
726
726
726
725
725
725
725
724
724
724
723
723
722
722
722
722
722
722
721
721
721
721
721
721
721
720
720
720
719
719
719
718
718
718
718
718
718
717
717
717
716
716
716
715
715
715
715
715
715
714
714
713
713
713
711
711
710
710
710
709
709
708
708
707
707
707
707
706
706
705
705
705
705
705
704
704
704
704
704
704
704
704
703
703
702
702
702
702
701
701
700
700
699
699
698
698
698
698
698
697
697
697
696
696
696
695
694
694
694
694
694
693
693
693
691
691
690
690
689
688
688
688
687
686
685
685
684
684
684
684
684
683
682
681
681
681
681
681
681
680
679
679
679
678
678
678
678
675
675
675
675
674
674
674
674
673
673
673
672
672
670
670
670
670
670
669
669
669
669
669
667
667
667
667
667
667
667
667
666
665
665
664
664
664
664
663
663
663
663
662
662
662
662
661
661
661
660
660
660
660
659
658
658
658
658
657
657
656
656
655
655
654
654
654
654
654
653
653
653
652
652
652
652
652
651
651
651
650
649
649
649
648
648
648
648
648
647
647
647
646
646
646
646
646
645
645
644
644
642
642
642
641
641
641
641
640
639
639
639
639
638
638
638
637
636
636
636
636
636
636
635
635
634
633
633
632
632
632
631
631
631
631
629
629
629
629
629
628
628
627
627
627
627
626
626
626
626
625
625
624
623
623
623
623
623
623
623
622
622
622
622
622
621
621
621
621
620
618
618
618
618
617
617
617
616
615
615
615
614
614
614
614
613
613
613
612
612
612
612
612
611
611
611
610
610
610
609
609
609
609
609
608
608
608
608
607
607
607
607
607
607
606
606
605
604
603
603
602
602
601
601
600
600
600
599
599
599
599
598
597
597
597
597
597
597
597
596
596
595
595
594
594
594
594
593
593
593
593
593
592
592
592
592
591
590
590
590
590
590
589
589
589
588
588
588
587
587
586
586
586
586
585
585
585
585
585
584
584
584
584
583
583
583
583
583
583
583
583
583
582
581
581
581
580
580
580
580
579
579
579
579
579
579
579
578
578
578
578
578
577
577
577
577
577
577
576
576
576
576
575
575
575
575
575
575
575
574
574
574
574
574
574
574
573
572
572
572
572
572
571
571
571
571
571
571
571
570
570
570
570
569
569
569
569
569
569
569
569
569
568
568
568
568
568
568
567
567
567
567
567
566
566
565
565
565
565
565
564
564
564
564
564
563
563
562
562
562
561
560
560
560
560
560
559
559
559
559
558
558
558
558
558
557
556
556
556
556
555
555
555
555
553
553
553
553
553
553
553
552
552
552
552
552
551
551
551
551
550
550
550
550
550
549
549
549
548
548
547
547
546
546
546
546
546
546
546
546
545
545
545
545
545
545
544
543
543
543
543
542
542
542
542
542
542
542
541
541
541
541
541
541
540
540
540
540
539
539
539
539
538
538
537
537
537
537
537
537
537
537
537
537
536
536
535
535
534
534
534
534
534
534
533
533
533
533
533
533
533
532
532
532
532
532
531
531
531
531
531
531
530
530
530
529
529
528
528
528
528
527
527
527
527
527
526
526
526
526
526
526
526
525
525
525
525
524
524
523
523
523
523
523
522
522
522
521
521
521
521
520
520
520
520
520
520
519
519
518
518
518
518
517
517
517
517
517
517
516
516
516
516
516
515
514
514
514
514
514
513
513
513
513
513
513
513
512
512
512
512
512
511
511
511
511
510
510
509
509
509
509
509
509
508
508
508
508
507
507
507
507
506
506
506
506
505
505
505
504
504
504
504
503
503
503
502
502
502
501
501
501
501
500
500
500
500
500
499
499
498
498
498
498
498
498
498
498
497
496
496
496
496
495
495
495
494
494
494
494
494
493
493
492
492
492
492
491
491
491
491
491
490
490
490
489
489
488
488
488
488
487
487
486
486
486
485
485
485
485
484
484
484
484
484
483
483
483
483
483
483
483
483
483
483
483
483
482
482
482
482
482
481
481
481
480
480
480
479
479
478
478
478
478
478
476
476
476
476
476
475
475
475
475
475
475
474
474
474
474
474
474
474
473
472
472
471
471
471
471
471
470
470
470
470
470
470
470
470
470
469
469
469
469
469
469
469
468
468
468
468
468
468
468
467
467
467
467
467
467
467
467
466
466
466
466
466
466
465
465
465
465
465
464
464
464
464
464
464
464
463
463
463
462
462
462
462
461
461
461
460
460
460
460
459
459
459
459
458
458
458
458
458
458
458
457
457
457
457
457
456
456
456
456
456
456
456
456
456
455
455
455
455
455
455
455
454
454
454
454
454
454
454
453
453
453
453
452
452
451
450
450
450
450
450
450
449
449
449
449
449
449
448
448
448
448
448
448
448
446
446
446
446
446
446
446
446
445
445
445
445
445
444
444
444
444
444
444
444
444
443
443
443
443
443
442
442
442
442
442
442
442
442
441
441
441
441
441
441
441
440
440
440
440
440
440
440
440
440
439
439
439
439
439
438
438
437
437
437
436
436
436
436
436
436
436
435
435
435
435
435
435
435
434
434
434
434
434
434
433
433
433
433
433
433
432
432
432
432
431
431
431
431
431
430
430
430
430
430
430
430
429
429
429
428
428
428
428
428
428
428
427
427
427
427
427
426
426
426
426
426
426
426
426
425
425
425
425
425
424
424
424
424
424
424
424
424
424
424
424
423
423
423
423
423
423
423
422
422
422
422
421
421
421
421
421
420
420
420
420
420
420
420
419
419
419
419
419
419
418
418
418
418
418
418
418
417
417
417
416
416
416
416
416
416
415
415
415
415
415
415
414
414
414
414
413
413
413
413
413
413
413
413
412
412
412
412
412
412
411
411
411
410
410
410
410
410
410
410
410
409
409
409
409
409
409
409
409
409
409
409
408
408
408
408
408
408
407
407
407
407
406
406
406
406
406
406
405
405
405
405
405
405
404
404
404
404
404
404
403
403
403
402
402
402
402
402
402
402
401
401
401
401
401
401
401
400
400
400
400
400
400
400
400
399
399
399
399
399
399
399
398
398
398
398
397
397
397
396
396
396
396
396
396
396
396
396
396
395
395
395
394
394
394
394
394
394
394
394
394
393
393
393
393
393
393
393
393
393
392
392
392
392
392
392
392
392
392
392
392
392
392
392
392
391
391
391
391
391
390
390
390
390
390
390
390
390
390
390
390
389
389
389
389
389
389
389
389
389
388
388
388
388
388
388
388
388
387
387
386
386
386
386
386
386
386
386
386
386
385
385
385
385
385
385
384
384
384
383
383
383
383
383
383
383
383
383
382
382
382
382
382
382
382
382
382
381
381
381
381
381
381
381
380
380
379
379
379
378
378
378
378
378
378
378
378
378
378
377
377
377
377
377
377
377
377
377
376
376
376
376
376
376
376
375
375
375
375
375
375
375
375
375
375
374
374
374
373
373
373
373
373
373
373
373
373
373
373
373
372
372
372
372
372
372
372
372
371
371
371
371
371
371
371
371
371
370
370
370
370
369
369
369
369
369
368
368
368
368
368
368
368
368
368
367
367
367
367
367
367
366
366
366
366
366
366
366
366
366
366
365
365
365
365
365
365
365
365
364
364
364
364
364
363
363
363
363
363
363
363
363
363
362
362
362
362
362
362
362
362
362
361
361
361
361
361
361
361
361
360
360
360
360
360
360
360
360
360
360
360
360
360
359
359
359
359
359
359
359
359
358
358
358
358
358
358
358
358
358
357
357
357
357
357
357
357
357
357
356
356
356
355
355
355
355
355
355
355
355
355
355
354
354
354
354
354
354
354
354
354
354
353
353
353
353
353
353
353
353
353
353
352
352
352
352
352
352
351
351
351
351
351
351
350
350
350
350
350
350
350
350
350
350
350
350
349
349
349
349
349
349
348
348
348
348
348
348
347
347
347
347
347
347
347
347
347
347
347
347
347
347
346
346
346
346
346
346
345
345
345
345
345
345
345
345
345
345
345
344
344
344
344
344
344
344
344
344
344
343
343
343
343
343
343
343
343
343
342
342
342
342
342
341
341
341
341
341
341
341
341
341
341
341
341
341
340
340
340
340
340
340
340
340
340
340
340
340
340
340
339
339
339
339
339
339
339
339
339
339
339
338
338
338
338
338
338
338
338
338
338
338
338
338
338
337
337
337
337
337
337
336
336
336
336
336
336
336
336
336
336
336
336
336
336
336
335
335
335
335
335
335
335
335
335
334
334
334
334
334
334
334
334
333
333
333
333
333
333
333
333
333
333
333
332
332
332
332
332
332
332
332
332
332
331
331
331
331
331
331
331
330
330
330
330
330
330
330
330
330
330
329
329
329
329
329
329
329
329
329
328
328
328
328
328
328
328
328
328
328
328
327
327
327
327
327
327
327
327
327
327
327
327
327
326
326
326
326
326
326
326
326
326
326
326
326
326
326
326
326
326
325
325
325
325
325
325
325
325
325
325
325
325
325
325
325
324
324
324
324
324
324
324
324
323
323
323
323
323
323
323
323
323
323
323
323
323
322
322
322
322
322
322
322
322
322
322
322
322
322
321
321
321
321
321
321
321
321
321
321
321
321
321
320
320
320
320
320
320
319
319
319
319
319
319
319
318
318
318
318
318
318
318
318
318
318
318
318
317
317
317
317
317
317
317
317
317
317
317
317
317
317
317
317
317
317
317
317
317
317
316
316
316
316
316
316
316
316
316
316
316
316
316
316
316
315
315
315
315
315
315
315
315
315
315
315
315
315
314
314
314
314
314
314
314
314
314
314
314
314
314
314
314
314
313
313
313
313
313
313
313
313
313
313
313
313
312
312
312
312
312
312
312
312
312
311
311
311
311
311
311
311
311
310
310
310
310
310
310
310
310
310
310
310
310
310
310
309
309
309
309
309
309
309
309
308
308
308
308
308
308
308
308
308
308
308
308
308
308
308
308
308
308
308
307
307
307
307
307
307
307
307
307
306
306
306
306
306
306
306
306
306
306
306
306
306
306
305
305
305
305
305
305
305
305
305
305
305
305
305
305
305
304
304
304
304
304
304
304
303
303
303
303
303
303
303
303
303
303
303
303
302
302
302
302
302
302
302
302
302
302
302
301
301
301
301
301
301
301
301
301
300
300
300
300
300
300
300
300
300
300
299
299
299
299
299
299
299
299
299
299
299
299
299
299
298
298
298
298
298
298
298
298
298
298
298
297
297
297
297
297
297
297
297
297
297
297
297
297
297
297
297
297
297
297
297
297
296
296
296
296
296
296
296
296
296
296
296
296
296
296
296
295
295
295
295
295
295
295
295
295
294
294
294
294
294
294
294
294
294
294
294
294
294
294
293
293
293
293
293
293
293
293
293
293
292
292
292
292
292
292
292
292
292
292
292
292
292
292
292
292
292
292
292
291
291
291
291
291
291
291
291
291
291
291
291
290
290
290
290
290
290
290
290
290
290
290
290
290
290
289
289
289
289
289
289
289
289
289
289
289
289
289
289
288
288
288
288
288
288
288
288
288
288
288
288
287
287
287
287
287
287
287
286
286
286
286
286
286
286
286
286
286
286
286
286
285
285
285
285
285
285
285
285
285
285
284
284
284
284
284
284
284
284
284
284
284
284
284
284
284
284
284
284
283
283
283
283
283
283
283
283
283
283
283
283
283
283
283
282
282
282
282
282
282
282
282
281
281
281
281
281
281
281
281
281
281
281
280
280
280
280
280
280
280
280
280
280
280
280
280
280
279
279
279
279
279
279
279
279
278
278
278
278
278
278
278
278
278
278
277
277
277
277
277
277
277
277
277
277
277
277
277
277
277
277
277
277
277
277
276
276
276
276
276
276
276
276
275
275
275
275
275
275
275
275
274
274
274
274
274
274
274
274
274
274
274
274
274
273
273
273
273
273
273
273
273
273
273
273
272
272
272
272
272
272
272
272
272
272
272
272
272
271
271
271
271
271
271
271
271
271
271
271
271
271
271
271
271
270
270
270
270
270
270
270
270
270
270
270
270
270
270
270
269
269
269
269
269
269
269
269
269
269
269
269
269
268
268
268
268
268
268
268
268
268
268
268
268
268
268
268
267
267
267
267
267
267
267
267
267
267
267
267
267
267
266
266
266
266
266
266
266
266
266
266
266
266
265
265
265
265
265
265
265
265
265
265
265
264
264
264
264
264
264
264
264
264
264
263
263
263
263
263
263
263
263
263
263
262
262
262
262
262
262
262
262
262
262
262
262
262
261
261
261
261
261
261
261
261
261
261
261
261
261
261
261
261
260
260
260
260
260
260
260
260
260
260
260
260
259
259
259
259
259
259
259
259
259
259
259
258
258
258
258
258
258
258
258
258
258
258
258
258
258
258
258
258
258
258
257
257
257
257
257
257
257
257
257
257
257
257
257
257
256
256
256
256
256
256
256
256
256
256
256
256
256
256
256
256
256
256
256
256
256
255
255
255
255
255
255
255
255
255
255
255
255
255
255
255
255
255
255
254
254
254
254
254
254
254
254
254
254
254
254
254
254
253
253
253
253
253
253
253
253
253
253
253
253
252
252
252
252
252
252
252
252
252
252
252
252
252
252
252
251
251
251
251
251
251
251
251
251
251
251
251
251
251
251
251
250
250
250
250
250
250
250
250
250
250
250
250
250
250
250
250
250
249
249
249
249
249
249
249
249
249
249
249
249
248
248
248
248
248
248
248
248
248
248
248
248
248
248
247
247
247
247
247
247
247
247
247
247
247
247
247
247
247
247
247
247
247
247
246
246
246
246
246
246
246
246
246
246
246
246
246
246
246
245
245
245
245
245
245
245
245
245
245
245
245
245
245
245
245
245
245
245
244
244
244
244
244
244
244
244
244
244
244
244
244
244
244
244
244
244
244
244
244
243
243
243
243
243
243
243
243
243
243
243
243
243
243
243
243
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
242
241
241
241
241
241
241
241
241
241
241
241
241
241
241
240
240
240
240
240
240
240
240
240
240
240
240
240
240
240
239
239
239
239
239
239
239
239
239
239
239
239
239
239
239
239
239
239
239
239
239
238
238
238
238
238
238
238
238
238
238
238
238
238
238
238
238
237
237
237
237
237
237
237
237
237
237
237
237
237
237
236
236
236
236
236
236
236
236
236
236
236
236
236
236
236
236
236
236
236
236
236
236
236
235
235
235
235
235
235
235
235
235
235
235
235
235
235
235
235
235
234
234
234
234
234
234
234
234
234
234
234
234
234
234
234
234
234
234
234
234
233
233
233
233
233
233
233
233
233
233
232
232
232
232
232
232
232
232
232
232
232
232
232
232
232
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
231
230
230
230
230
230
230
230
230
230
230
230
230
230
229
229
229
229
229
229
229
229
229
229
229
229
229
229
229
229
229
229
228
228
228
228
228
228
228
228
228
228
228
228
227
227
227
227
227
227
227
227
227
227
226
226
226
226
226
226
226
226
226
226
226
226
226
226
226
226
226
226
226
226
226
226
225
225
225
225
225
225
225
225
225
225
225
225
225
225
225
225
225
225
225
225
225
224
224
224
224
224
224
224
224
224
224
224
224
224
224
223
223
223
223
223
223
223
223
223
223
223
223
223
223
223
223
223
223
222
222
222
222
222
222
222
222
222
222
222
222
222
222
222
222
222
222
221
221
221
221
221
221
221
221
221
221
221
221
221
220
220
220
220
220
220
220
220
220
220
220
220
220
220
220
220
220
220
220
220
220
219
219
219
219
219
219
219
219
219
219
219
219
218
218
218
218
218
218
218
218
218
218
218
218
218
218
218
218
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
217
216
216
216
216
216
216
216
216
216
216
216
216
216
216
215
215
215
215
215
215
215
215
215
215
215
215
215
215
215
215
215
214
214
214
214
214
214
214
214
214
214
214
214
214
214
214
214
214
213
213
213
213
213
213
213
213
213
213
213
213
213
213
213
213
213
212
212
212
212
212
212
212
212
212
212
212
212
212
212
212
212
212
212
212
212
212
212
212
212
211
211
211
211
211
211
211
211
211
211
211
211
211
211
211
211
211
211
211
210
210
210
210
210
210
210
210
210
210
210
210
210
210
210
210
210
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
209
208
208
208
208
208
208
208
208
208
208
208
208
208
208
208
208
208
208
208
208
208
208
208
208
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
207
206
206
206
206
206
206
206
206
206
206
206
206
206
206
206
206
206
206
206
206
206
206
205
205
205
205
205
205
205
205
205
205
205
205
205
205
205
205
205
205
205
205
205
205
205
205
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
204
203
203
203
203
203
203
203
203
203
203
203
203
203
203
203
203
203
203
203
203
203
203
202
202
202
202
202
202
202
202
202
202
202
202
202
202
202
202
202
202
202
202
202
202
201
201
201
201
201
201
201
201
201
201
201
201
201
201
201
201
201
201
201
201
200
200
200
200
200
200
200
200
200
200
200
200
200
200
200
200
200
200
200
200
200
200
200
200
199
199
199
199
199
199
199
199
199
199
199
199
199
199
199
199
199
199
199
198
198
198
198
198
198
198
198
198
198
198
198
198
198
198
198
198
198
198
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
197
196
196
196
196
196
196
196
196
196
196
196
196
196
196
196
196
196
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
195
194
194
194
194
194
194
194
194
194
194
194
194
194
194
194
194
194
194
194
194
194
194
194
194
193
193
193
193
193
193
193
193
193
193
193
193
193
192
192
192
192
192
192
192
192
192
192
192
192
192
192
192
192
192
192
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
191
190
190
190
190
190
190
190
190
190
190
190
190
190
190
190
190
190
190
190
190
190
190
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
189
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
188
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
187
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
186
185
185
185
185
185
185
185
185
185
185
185
185
185
185
185
185
185
185
185
185
185
185
185
185
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
184
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
183
182
182
182
182
182
182
182
182
182
182
182
182
182
182
182
182
182
182
182
182
182
182
182
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
181
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
180
179
179
179
179
179
179
179
179
179
179
179
179
179
179
179
179
179
179
179
179
179
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
178
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
177
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
176
175
175
175
175
175
175
175
175
175
175
175
175
175
175
175
175
175
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
174
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
173
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
172
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
171
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
170
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
169
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
168
167
167
167
167
167
167
167
167
167
167
167
167
167
167
167
167
167
167
167
167
167
167
167
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
166
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
165
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
164
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
163
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
162
161
161
161
161
161
161
161
161
161
161
161
161
161
161
161
161
161
161
161
161
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
160
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
159
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
158
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
157
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
156
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
155
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
154
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
153
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
152
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
151
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
150
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
149
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
148
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
147
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
146
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
145
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
144
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
143
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
142
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
141
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
140
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
139
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
138
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
137
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
136
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
135
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
134
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
133
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
132
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
131
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
130
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
129
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
128
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
127
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
126
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
125
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
124
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
122
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
121
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
120
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
119
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
118
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
117
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
116
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
115
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
114
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
113
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
112
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
111
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
110
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
109
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
108
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
107
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
106
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
105
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
104
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
103
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
102
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
101
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
100
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
99
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
98
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
97
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
96
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
95
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
94
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
93
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
92
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
91
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
90
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
89
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
88
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
87
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
86
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
85
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
84
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
83
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
82
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
81
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
80
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
79
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
78
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
77
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
76
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
75
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
74
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
73
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
72
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
71
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
70
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
69
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
68
